math251/one_two.tex
% Created 2024-08-23 Fri 09:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{One Two}
\hypersetup{
 pdfauthor={},
 pdftitle={One Two},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Example}
\label{sec:org6c0c6f1}
\left (
\begin{array}{ccc|c}
1 & 0 & 0 & 1\\
0 & 1 & 0 & 2\\
0 & 0 & 1 & 3
\end{array}
\right )

Now apply the row operation from example 3, section 1.1 (we will come back to this)
\section{Gausian Elimination}
\label{sec:org6589f87}
\subsection{Reduced Row Echelon Form}
\label{sec:org56c2c3e}
\begin{enumerate}
\item If a row does not consist entirely of zeros, then the first nonzero number in the row is a 1, this is called a leading 1
\item If there are any rows that consist entirely of zeros, then they are grouped together at the bottom of the matrix
\item In any 2 seuccessive rows that do not consist entirely of zeros, the leading 1 in the lower rows occurs farther to the right than the leading 1 in the higher row.
\item Each column that contains a leading 1 has zeros everywhere else in the column
\end{enumerate}

A matrix that has props 1-3 is in \textbf{row echelon form}, thus a matrix in reduced row echelon form is of necessity in row echelon form.
\subsubsection{Example 1}
\label{sec:orge77db66}
Which of these are in reduced echelon form

yes
\left (
\begin{array}{ccc|c}
1 & 0 & 0 & 4\\
0&1&0&7\\
0&0&1&-1
\end{array}
\right )

yes
\left (
\begin{array}{cc|c}
1&0&0\\
0&1&0\\
0&0&1
\end{array}
\right )

yes
\left (
\begin{array}{cccc|c}
0&1&-2&0&1\\
0&0&0&1&3\\
0&0&0&0&0\\
0&0&0&0&0
\end{array}
\right )

yes
\left (
\begin{array}{c|c}
0&0\\
0&0
\end{array}
\right )

no
\left (
\begin{array}{ccc|c}
1&4&-3&7
0&1&6&2\\
0&0&1&5
\end{array}
\right )

no
\left (
\begin{array}{cc|c}
1&1&0\\
0&1&0\\
0&0&)
\end{array}
\right )

no

$\backslash$[
\left {[}
\begin{array}{cccc|c}
0&1&2&6&0\\
0&0&1&-1&0\\
0&0&0&0&1
\end{array}
\right ]
$\backslash$]
\end{document}
